diplom-src/src/DataProcessors/ВКМ_Календарь/ВКМ_Календарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_Календарь</name>
  <comment>Планировщик времени специалистов</comment>
</mdclass:DataProcessor>

diplom-src/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/DataProcessors/ВКМ_Календарь/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
	
	Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	
	ОбслуживаниеКлиентов = Документы.ВКМ_ОбслуживаниеКлиента.Выбрать(НачалоПериода, КонецПериода);
	
	ОбновитьПланировщикНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПланировщикНаСервере()
	
	НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
	
	Планировщик.Элементы.Очистить();
	
	ОбслуживаниеКлиентов = Документы.ВКМ_ОбслуживаниеКлиента.Выбрать(НачалоПериода, КонецПериода);
	
	Пока ОбслуживаниеКлиентов.Следующий() Цикл
		
		НачалоОбслуживание = ОбслуживаниеКлиентов.ДатаПроведенияРабот + 
		(Час(ОбслуживаниеКлиентов.ВремяНачалаРаботПлан) * 60 * 60 + Минута(ОбслуживаниеКлиентов.ВремяНачалаРаботПлан) * 60);
		КонецОбслуживание = ОбслуживаниеКлиентов.ДатаПроведенияРабот + 
		(Час(ОбслуживаниеКлиентов.ВремяОкончанияРаботПлан) * 60 * 60 + Минута(ОбслуживаниеКлиентов.ВремяОкончанияРаботПлан) * 60);
		
		ЭлементПланировщика = Планировщик.Элементы.Добавить(НачалоОбслуживание, КонецОбслуживание);
		ЭлементПланировщика.Значение = ОбслуживаниеКлиентов.Ссылка;
		ЭлементПланировщика.Текст = ОбслуживаниеКлиентов.Специалист;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКалендарь(Команда)
	
	ОбновитьПланировщикНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ДатаПроведенияРабот", Дата(Начало));
	ЗначенияЗаполнения.Вставить("ВремяНачалаРаботПлан", Дата(Начало));
	ЗначенияЗаполнения.Вставить("ВремяОкончанияРаботПлан", Дата(Конец));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ВКМ_ОбслуживаниеКлиента" Тогда
		
		ОбновитьПланировщикНаСервере(); 
		
	КонецЕсли;
	
КонецПроцедуры
